Revit 2026 API

# FamilyStructuralCodeName Property

---

The family's structural code name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string StructuralCodeName { get; set; }
```
```vb
Public Property StructuralCodeName As String
	Get
	Set
```
```cpp
public:
property String^ StructuralCodeName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member StructuralCodeName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Family Class

Autodesk.Revit.DB Namespace